app/Models/TaskModel.php

SELECT *
FROM `tasks`
WHERE `task_date` = '2026-09-19'
ORDER BY `created_at` ASC
---
    public function getTodayTasks(): array
    {
        return $this
            ->where('task_date', date('Y-m-d'))
            ->orderBy('created_at', 'ASC')
            ->findAll();

SELECT *
FROM `tasks`
ORDER BY `task_date` ASC, `created_at` ASC
---
    public function getAllTasks(): array
    {
        return $this
            ->orderBy('task_date', 'ASC')
            ->orderBy('created_at', 'ASC')
            ->findAll();