app/Models/UserModel.php

    public function getDemoUser(): ?array
    {
        return $this->first();
---
SELECT *
FROM `users`
 LIMIT 1